spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_error_exit() {}

void SmdSat::state_error() {
	SMD_STATE_CHANGE(error, stopped);
}

void SmdSat::state_stopped_enter() {
	m_cmd.deinit();

	// Release wakeup pin LOW so SMD can enter deep sleep (STANDBY/SHUTDOWN)
	// before power is cut. This allows the STM32 to enter LPM immediately.
#ifdef SAT_EXTWAKEUP
	GPIOPins::clear(SAT_EXTWAKEUP);
#endif

	this->shutdown();
	GPIOPins::release_sensors_pwr();
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);

	// Keep is_kmac_profil_loaded = true — the KMAC profile is persisted in
	// SMD flash and does not need reloading on every boot. It is only reset
	// to false when credentials change or a deferred RCONF is applied.

	m_packet_buffer.clear();

	notify(KineisEventPowerOff({}));
}

void SmdSat::state_stopped_exit() {}
void SmdSat::state_stopped() {}

void SmdSat::state_powering_on_enter() {}

void SmdSat::state_powering_on_exit() {
	m_next_delay = SMDSAT_SPI_BOOT_DELAY_MS;
}

void SmdSat::state_powering_on() {
	DEBUG_TRACE("SmdSat::%s: Starting power-on sequence", __func__);

	GPIOPins::acquire_sensors_pwr();

	// Step 1: Assert RESET LOW before powering on — hold STM32WL in reset
	// during VDD ramp-up to prevent undefined behavior at low voltage.
	// SAT_RESET is open-drain (S0D1) with external pull-up on SMD VDD rail.
	// While SAT_PWR_EN is LOW, the pull-up is unpowered → no leakage.
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);

	// Step 2: Assert wakeup pin HIGH (LinkIt only) before power-on
#ifdef SAT_EXTWAKEUP
	GPIOPins::init_pin(SAT_EXTWAKEUP);
	GPIOPins::set(SAT_EXTWAKEUP);
#endif

	// Step 3: Power ON — VDD ramp starts, STM32WL held in reset by RESET_B=LOW
	// VPA stays LOW (driven by nRF) to prevent PA regulator activation during boot.
	GPIOPins::set(SAT_PWR_EN);
	DEBUG_TRACE("SmdSat::%s: SAT_PWR_EN=HIGH, RESET=LOW, VPA=LOW", __func__);

	// Step 4: Wait for VDD stabilization (150ms >> 5ms required)
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Step 5: Release RESET — pull-up on SMD VDD rail pulls HIGH → STM32WL boots
	GPIOPins::release_to_highz(SAT_RESET);
	DEBUG_TRACE("SmdSat::%s: RESET released, VPA held LOW until ping OK", __func__);

	SMD_STATE_CHANGE(powering_on, idle_pending);
}

void SmdSat::state_load_kmac_enter() {}
void SmdSat::state_load_kmac_exit() {}

void SmdSat::state_load_kmac() {
	// Apply deferred RCONF from switch_modulation() while stopped.
	// This only happens on error recovery — normal modulation switches
	// are done while the SMD is still powered on (at deinit time).
	if (!m_pending_rconf.empty()) {
		DEBUG_INFO("SmdSat::%s: applying deferred RCONF for modulation %d", __func__, (int)m_modulation);
		auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };
		std::string rconf_bin = Binascii::unhexlify(m_pending_rconf);
		smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
		                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
		try {
			m_cmd.set_radio_conf(&rconf_struct);
			wait_cmd();
			m_cmd.save_radio_conf();
			wait_cmd();
			m_cmd.load_kmac_profil(1);
			wait_cmd();
			is_kmac_profil_loaded = true;
			m_credentials_written = true;
			DEBUG_INFO("SmdSat::%s: deferred RCONF applied OK", __func__);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to apply deferred RCONF", __func__);
		}
		m_pending_rconf.clear();
	}

	// Write credentials only if changed via DTE since last write.
	// Must happen BEFORE load_kmac_profil so the KMAC profile uses the new credentials.
	if (!m_credentials_written) {
		m_credentials_written = true;
		if (configuration_store && configuration_store->is_credentials_dirty()) {
			DEBUG_INFO("SmdSat::%s: credentials dirty, writing to SMD", __func__);
			if (!write_credentials_from_config()) {
				DEBUG_ERROR("SmdSat::%s: credential write failed", __func__);
				SMD_STATE_CHANGE(load_kmac, error);
				return;
			}
			configuration_store->clear_credentials_dirty();
			// Force KMAC reload after credential write so the profile picks up
			// the new RCONF/seckey/ID — without this, TX fails.
			is_kmac_profil_loaded = false;
		}
	}

	uint8_t kmac_status = 0;
	m_cmd.get_kmac_status(&kmac_status);
	if (kmac_status == MAC_OK) {
		if (!is_kmac_profil_loaded) {
			m_cmd.load_kmac_profil(1);
			m_next_delay = SMDSAT_DELAY_LOAD_KMAC_MS;
			is_kmac_profil_loaded = true;
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}

		// Write TCXO warmup to SMD on every boot — this register is not
		// persisted in flash by the STM32 and defaults to factory value.
		try {
			m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
			DEBUG_TRACE("SmdSat::%s: TCXO warmup written: %u s", __func__, m_tcxo_warmup_time);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: failed to write TCXO warmup", __func__);
		}

		// Write LPM mode if not NONE — RAM-only register on STM32, lost on reset.
		// The module is fully powered off between sessions (SAT_PWR_EN=LOW).
		// LPM is used during idle wait (between TX in same session) to save power.
		if (m_lpm_mode != 0x01) {
			try {
				m_cmd.write_lpm(&m_lpm_mode);
				DEBUG_INFO("SmdSat::%s: LPM mode written: 0x%02X", __func__, m_lpm_mode);
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: failed to write LPM mode", __func__);
			}
		}

		SMD_STATE_CHANGE(load_kmac, idle_pending);
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter load kmac state",__func__);
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		}
	}
}

void SmdSat::state_idle_pending_enter() {
	// Init SPI here (after power-on + reset release) to avoid MISO backfeed.
	// STM32WL has booted and its GPIOs are in a defined state now.
	m_cmd.init();
	m_next_delay = SMDSAT_DELAY_CMD_MS;
	m_state_counter = 10;
}

void SmdSat::state_idle_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle_pending() {
	if (m_cmd.ping()) {
		// VPA stays LOW — only released just before TX (state_transmit_pending)
		if (!is_kmac_profil_loaded) {
			SMD_STATE_CHANGE(idle_pending, load_kmac);
		} else {
			SMD_STATE_CHANGE(idle_pending, idle);
		}
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: failed to enter IDLE state",__func__);
			SMD_STATE_CHANGE(idle_pending, error);
		} else {
			m_next_delay = SMDSAT_DELAY_CMD_MS;
		}
	}
}

void SmdSat::state_idle_enter() {
	m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;

	// If LPM allows STANDBY/SHUTDOWN, release wakeup pin LOW so SMD can
	// enter deep sleep while waiting for next TX in this session.
#ifdef SAT_EXTWAKEUP
	if (m_lpm_mode & 0x18) {
		GPIOPins::clear(SAT_EXTWAKEUP);
		DEBUG_TRACE("SmdSat::%s: WKUP LOW (LPM=0x%02X)", __func__, m_lpm_mode);
	}
#endif
}

void SmdSat::state_idle_exit() {
	// Wake SMD from deep sleep before any SPI command (TX or stop)
#ifdef SAT_EXTWAKEUP
	if (m_lpm_mode & 0x18) {
		GPIOPins::set(SAT_EXTWAKEUP);
		nrf_delay_ms(50);  // STM32 wakeup from STANDBY/SHUTDOWN takes ~50ms
		DEBUG_TRACE("SmdSat::%s: WKUP HIGH (wakeup from LPM)", __func__);
	}
#endif
	m_next_delay = SMDSAT_DELAY_CMD_MS;
}

void SmdSat::state_idle() {
	if (m_packet_buffer.length()) {
		m_tx_buffer = m_packet_buffer;
		m_packet_buffer.clear();
		SMD_STATE_CHANGE(idle, transmit_pending);
	} else if (m_stopping) {
		SMD_STATE_CHANGE(idle, stopped);
	} else {
		m_next_delay = SMDSAT_DELAY_TICK_INTERRUPT_MS;
		if (--m_state_counter == 0) {
			DEBUG_TRACE("SmdSat::%s: idle timeout elapsed",__func__);
			SMD_STATE_CHANGE(idle, stopped);
		}
		return;
	}

	m_state_counter = m_idle_timeout_ms / SMDSAT_DELAY_TICK_INTERRUPT_MS;
}

